/******************************************************************************\
**  版    权 :  深圳市和而泰智能控制股份有限公司所有（2020）
**  文件名称 :  i2c.h
**  功能描述 :  迈来芯红外热传感器I2C驱动
**  作    者 :  杨守明
**  日    期 :  2020-1-10
**  版    本 :  V0.0.1
**  变更记录 :  V0.0.1/2020-1-10
                1.首次创建
\******************************************************************************/

/*
使用说明：
1.一次调用 status = mlx_init(); 进行传感器初始化，返回错误或者传感器的型号
2.循环调用 status = mlx_get_source_data(p_source); 采集原始数据
3.循环调用 status = mlx_get_calculate_data(p_calc,p_source); 计算图像数据

*/


#ifndef _I2C_H_
#define _I2C_H_
/******************************************************************************\
                             Includes
\******************************************************************************/

#include <stdint.h>

/******************************************************************************\
                          Macro definitions
\******************************************************************************/

/******************************************************************************\
                         Typedef definitions
\******************************************************************************/

/******************************************************************************\
                    Global variables and functions
\******************************************************************************/

/******************************************************************************/
/*
* 函数名称 : mlx_init
* 功能描述 : 传感器初始化
* 参    数 : 无
* 返回值   : @-1	错误
			 @0		传感器型号 90640 (24*32)
			 @1		传感器型号 90641 (12*16)  
* 示    例 : status = mlx_init();
*/
/******************************************************************************/
extern int mlx_init(void);

/******************************************************************************/
/*
* 函数名称 : mlx_get_sensor_type
* 功能描述 : 获取传感器型号
* 参    数 : 无
* 返回值   : @0		传感器型号 90640 (24*32)
			 @1		传感器型号 90641 (12*16) 
* 示    例 : sensor_type = mlx_get_sensor_type();
*/
/******************************************************************************/
extern int mlx_get_sensor_type(void);

/******************************************************************************/
/*
* 函数名称 : mlx_get_source_data
* 功能描述 : 获取传感器原始图像数据
* 参    数 : @uint16_t *p_source	用于保存数据的指针，申请的内存应该不小于834个uint16_t
* 返回值   : @-1	错误
			 @0		正常
* 示    例 : status = mlx_get_source_data(p_source);
*/
/******************************************************************************/
extern int mlx_get_source_data(uint16_t *p_source);

/******************************************************************************/
/*
* 函数名称 : mlx_get_calculate_data
* 功能描述 : 获取传感器计算后的温度图像数据
* 参    数 : @float *p_calc		用于保存数据的指针，申请的内存应该不小于768个float
* 返回值   : @-1	错误
			 @0		正常
* 示    例 : status = mlx_get_calculate_data(p_calc,p_source);
*/
/******************************************************************************/
extern int mlx_get_calculate_data(float *p_calc,uint16_t *p_source);



#endif

/******************************* End of File (H) ******************************/
